{
    "standard":{
        "values": [
            "Au début de vos prochains tours, refaites un jet de Sursaut de magie sauvage (ignorez ce résultat sur des jets consécutifs). Cet effet dure une minute.",
            "Au début de vos prochains tours, refaites un jet de Sursaut de magie sauvage (ignorez ce résultat sur des jets consécutifs). Cet effet dure une minute.",
            "Pendant une minute, vous pouvez voir toutes les créatures invisibles tant qu'elles sont dans votre champs de vision.",
            "Pendant une minute, vous pouvez voir toutes les créatures invisibles tant qu'elles sont dans votre champs de vision.",
            "Un modron (créature artificielle) choisi et contrôlé par le MD apparaît dans un espace inoccupé à 1,50 mètre de vous. Il disparaît une minute plus tard.",
            "Un modron (créature artificielle) choisi et contrôlé par le MD apparaît dans un espace inoccupé à 1,50 mètre de vous. Il disparaît une minute plus tard.",
            "Vous lancez le sort boule de feu de niveau 3 centré sur vous.",
            "Vous lancez le sort boule de feu de niveau 3 centré sur vous.",
            "Vous lancez un sort projectile magique de niveau 5.",
            "Vous lancez un sort projectile magique de niveau 5.",
            "Lancez un d10. Votre taille varie de 2,50 cm x le résultat du jet. Si le résultat est paire vous grandissez, s'il est impair, vous rapetissez.",
            "Lancez un d10. Votre taille varie de 2,50 cm x le résultat du jet. Si le résultat est paire vous grandissez, s'il est impair, vous rapetissez.",
            "Vous lancez le sort confusion centré sur vous-même.",
            "Vous lancez le sort confusion centré sur vous-même.",
            "Pendant une minute, vous regagnez 5 points de vie au début de chacun de vos tours.",
            "Pendant une minute, vous regagnez 5 points de vie au début de chacun de vos tours.",
            "Une longue barbe faite de plumes vous pousse soudainement. Celle-ci s'évanouit dans un nuage de plumes lorsque vous éternuez.",
            "Une longue barbe faite de plumes vous pousse soudainement. Celle-ci s'évanouit dans un nuage de plumes lorsque vous éternuez.",
            "Vous lancez le sort graisse centré sur vous-même.",
            "Vous lancez le sort graisse centré sur vous-même.",
            "Les créatures ont un désavantage à leur jets de sauvegarde contre le prochain sort que vous lancez dans la minute qui suit.",
            "Les créatures ont un désavantage à leur jets de sauvegarde contre le prochain sort que vous lancez dans la minute qui suit.",
            "Votre peau devient bleu. Un sort de délivrance des malédictions peut mettre fin à cet effet.",
            "Votre peau devient bleu. Un sort de délivrance des malédictions peut mettre fin à cet effet.",
            "Un oeil apparaît sur votre front pendant une minute. Pendant cette durée, vous avez un avantage à vos jets de Sagesse (Perception) qui se basent sur la vue.",
            "Un oeil apparaît sur votre front pendant une minute. Pendant cette durée, vous avez un avantage à vos jets de Sagesse (Perception) qui se basent sur la vue.",
            "Pendant une minute, tout vos sorts dont le temps d'incantation est d'1 action ont un temps d'incantation d'1 action bonus.",
            "Pendant une minute, tout vos sorts dont le temps d'incantation est d'1 action ont un temps d'incantation d'1 action bonus.",
            "Vous vous téléportez à 18 mètres dans un espace inoccupé que vous pouvez voir.",
            "Vous vous téléportez à 18 mètres dans un espace inoccupé que vous pouvez voir.",
            "Vous êtes transporté dans le Plan Astral jusqu'à la fin de votre prochain tour, après quoi vous retournez à votre position d'origine, dans l'espace inoccupé le plus proche.",
            "Vous êtes transporté dans le Plan Astral jusqu'à la fin de votre prochain tour, après quoi vous retournez à votre position d'origine, dans l'espace inoccupé le plus proche.",
            "Le prochain sort que vous lancez dans la minute qui suit fait le maximum de dégâts.",
            "Le prochain sort que vous lancez dans la minute qui suit fait le maximum de dégâts.",
            "Lancez un d10. Votre âge varie d'un nombre d'années équivalent au résultat du jet. Si le résultat est pair, vous vieillissez, sinon vous rajeunissez (minimum 1 an).",
            "Lancez un d10. Votre âge varie d'un nombre d'années équivalent au résultat du jet. Si le résultat est pair, vous vieillissez, sinon vous rajeunissez (minimum 1 an).",
            "1d6 flumphs contrôlés par le MD apparaissent dans un périmètre de 18 mètres et ont peur de vous. Ils disparaissent au bout d'une minute.",
            "1d6 flumphs contrôlés par le MD apparaissent dans un périmètre de 18 mètres et ont peur de vous. Ils disparaissent au bout d'une minute.",
            "Vous regagnez 2d10 points de vie.",
            "Vous regagnez 2d10 points de vie.",
            "Vous vous transformez en plante en pot jusqu'au début de votre prochain tour. Sous cette forme, vous êtes incapable d'agir et avez la vulnérabilité à tous les types de dégâts. Si vous tombez à 0 point de vie, votre pot casse et vous retrouvez votre forme d'origine.",
            "Vous vous transformez en plante en pot jusqu'au début de votre prochain tour. Sous cette forme, vous êtes incapable d'agir et avez la vulnérabilité à tous les types de dégâts. Si vous tombez à 0 point de vie, votre pot casse et vous retrouvez votre forme d'origine.",
            "Pendant une minute, vous pouvez utiliser à chaque tour votre action bonus pour vous téléporter dans un rayon de 6 mètres.",
            "Pendant une minute, vous pouvez utiliser à chaque tour votre action bonus pour vous téléporter dans un rayon de 6 mètres.",
            "Vous lancez le sort lévitation sur vous.",
            "Vous lancez le sort lévitation sur vous.",
            "Une licorne contrôlée par le MD apparaît à 1,50 mètre de vous puis disparaît une minute plus tard.",
            "Une licorne contrôlée par le MD apparaît à 1,50 mètre de vous puis disparaît une minute plus tard.",
            "Vous ne pouvez plus parler pendant une minute. Chaque fois que vous essayez, des bulles roses sortent de votre bouche.",
            "Vous ne pouvez plus parler pendant une minute. Chaque fois que vous essayez, des bulles roses sortent de votre bouche.",
            "Un bouclier spectral vous entoure pendant une minute, vous faisant bénéficier d'une bonus de +2 à la CA et de l'immunité au sort projectile magique.",
            "Un bouclier spectral vous entoure pendant une minute, vous faisant bénéficier d'une bonus de +2 à la CA et de l'immunité au sort projectile magique.",
            "Vous êtes immunisé à l'intoxication par l'alcool pour les 5d6 prochains jours.",
            "Vous êtes immunisé à l'intoxication par l'alcool pour les 5d6 prochains jours.",
            "Vos cheveux tombent puis repoussent progressivement durant les prochaines 24 h.",
            "Vos cheveux tombent puis repoussent progressivement durant les prochaines 24 h.",
            "Pour la prochaine minute, tout objet inflammable que vous touchez qui n'est ni porté ni équipé par une autre créature prend feu.",
            "Pour la prochaine minute, tout objet inflammable que vous touchez qui n'est ni porté ni équipé par une autre créature prend feu.",
            "Vous regagnez votre emplacement de sort dépensé le plus faible.",
            "Vous regagnez votre emplacement de sort dépensé le plus faible.",
            "Pendant une minute, vous criez lorsque vous essayez de parler.",
            "Pendant une minute, vous criez lorsque vous essayez de parler.",
            "Vous lancez le sort nappe de brouillard centré sur vous-même.",
            "Vous lancez le sort nappe de brouillard centré sur vous-même.",
            "Jusqu'à 3 créatures, que vous choisissez, situées à 9 mètres ou moins de vous, prennent 4d10 dégâts de foudre.",
            "Jusqu'à 3 créatures, que vous choisissez, situées à 9 mètres ou moins de vous, prennent 4d10 dégâts de foudre.",
            "Vous êtes effrayé par la créature la plus proche de vous jusqu'à la fin de votre prochain tour.",
            "Vous êtes effrayé par la créature la plus proche de vous jusqu'à la fin de votre prochain tour.",
            "Toutes les créatures dans un rayon de 9 mètres deviennent invisibles pendant une minute. L'invisibilité prend fin lorsque la créature attaque ou lance un sort.",
            "Toutes les créatures dans un rayon de 9 mètres deviennent invisibles pendant une minute. L'invisibilité prend fin lorsque la créature attaque ou lance un sort.",
            "Vous obtenez la résistance à tous les dégâts pendant une minute.",
            "Vous obtenez la résistance à tous les dégâts pendant une minute.",
            "Une créature aléatoire située dans un rayon de 18 mètres est empoisonnée pendant 1d4 heures.",
            "Une créature aléatoire située dans un rayon de 18 mètres est empoisonnée pendant 1d4 heures.",
            "Vous vous mettez à briller dans un rayon de 9 mètres pendant une minute. Toute créature finissant son tour à 1,50 mètre de vous est aveuglée jusqu'à la fin de son prochain tour.",
            "Vous vous mettez à briller dans un rayon de 9 mètres pendant une minute. Toute créature finissant son tour à 1,50 mètre de vous est aveuglée jusqu'à la fin de son prochain tour.",
            "Vous lancez le sort métamorphose sur vous-même. Si vous ratez votre jet de sauvegarde, vous vous transformez en mouton pour la durée du sort.",
            "Vous lancez le sort métamorphose sur vous-même. Si vous ratez votre jet de sauvegarde, vous vous transformez en mouton pour la durée du sort.",
            "Des illusions de papillons et de pétales de fleur flottent autour de vous dans un rayon de 3 mètres pendant une minute.",
            "Des illusions de papillons et de pétales de fleur flottent autour de vous dans un rayon de 3 mètres pendant une minute.",
            "Vous obtenez 1 action supplémentaire immédiatement.",
            "Vous obtenez 1 action supplémentaire immédiatement.",
            "Toutes les créatures à 9 mètres ou moins prennent 1d10 de dégâts nécrotiques. Vous regagnez autant de points de vie que de dégâts infligés.",
            "Toutes les créatures à 9 mètres ou moins prennent 1d10 de dégâts nécrotiques. Vous regagnez autant de points de vie que de dégâts infligés.",
            "Vous lancez le sort image miroir.",
            "Vous lancez le sort image miroir.",
            "Vous lancez le sort vol sur une créature aléatoire dans un rayon de 18 mètres.",
            "Vous lancez le sort vol sur une créature aléatoire dans un rayon de 18 mètres.",
            "Vous devenez invisible pendant une minute. Pendant ce temps, les autres créatures ne peuvent pas vous entendre. L'invisibilité prend fin lorsque vous attaquez ou lancez un sort.",
            "Vous devenez invisible pendant une minute. Pendant ce temps, les autres créatures ne peuvent pas vous entendre. L'invisibilité prend fin lorsque vous attaquez ou lancez un sort.",
            "Si vous mourrez dans la minute qui suit, vous revenez immédiatement à la vie comme si vous étiez touché par le sort résurrection.",
            "Si vous mourrez dans la minute qui suit, vous revenez immédiatement à la vie comme si vous étiez touché par le sort résurrection.",
            "Votre taille augmente d'une catégorie pendant une minute.",
            "Votre taille augmente d'une catégorie pendant une minute.",
            "Vous et toutes les créatures dans un rayon de 9 mètres obtenez la vulnérabilité aux dégâts perforants pendant une minute.",
            "Vous et toutes les créatures dans un rayon de 9 mètres obtenez la vulnérabilité aux dégâts perforants pendant une minute.",
            "Vous êtes entouré d'une faible musique éthérée pendant une minute.",
            "Vous êtes entouré d'une faible musique éthérée pendant une minute.",
            "Vous regagnez tous vos points de sorcellerie.",
            "Vous regagnez tous vos points de sorcellerie."
        ]
    },
    "homebrew_1":{
        "_comment":"https://www.dndbeyond.com/forums/dungeons-dragons-discussion/homebrew-house-rules/89876-extended-wild-magic-table",
        "values": [
            "Au début de vos prochains tours, refaites un jet de Sursaut de magie sauvage (ignorez ce résultat sur des jets consécutifs). Cet effet dure une minute.",
            "Vous perdez votre concentration sur tous les sorts sur lesquels vous vous concentrez, et un champ antimagique vous entoure pendant la prochaine minute.",
            "Pendant la minute qui suit, vous pouvez voir n'importe quelle créature invisible si vous avez une ligne de vue sur elle.",
            "Toutes vos dents/cheveux tombent de votre bouche/tête et repoussent lentement en 10 minutes.",
            "Un modron choisi et contrôlé par le MJ apparaît dans un espace inoccupé à moins de 1,5 mètres de vous, puis disparaît 1 minute plus tard.",
            "Vous êtes affecté comme si vous veniez de boire un Philtre d'amour.",
            "Vous lancez boule de feu comme un sort de 3ème niveau centré sur vous.",
            "Votre taille diminue d'une catégorie de taille pendant la minute suivante.",
            "Vous lancez Projectile Magique comme un sort de 5ème niveau.",
            "Vous émettez un rot tonitruant qui reproduit l'effet d'un sort de Vague Tonnante de 1er niveau.",
            "Lancez un d10. Votre taille change d'un nombre de centimètres égal au résultat du jet. Si le résultat est impair, vous rétrécissez. Si le résultat est pair, vous grandissez.",
            "Jusqu'à 3 cadavres dans un rayon de 30 pieds autour de vous deviennent des zombies hostiles à toutes les créatures non-mortes.",
            "Vous lancez le sort Confusion centré sur vous-même.",
            "Votre corps et tout votre équipement prennent une apparence vitreuse pendant la minute qui suit. Pendant ce temps, les attaques à distance qui vous ciblent rebondissent et visent d'autres créatures aléatoires dans un rayon de 9 mètres autour de vous à la place.",
            "Pendant la minute suivante, vous regagnez 5 points de vie au début de chacun de vos tours.",
            "Pendant la minute qui suit, les seules langues que vous connaissez sont Profond, Primordial et Sylvestre.",
            "Vous vous laissez pousser une longue barbe faite de plumes qui reste en place jusqu'à ce que vous éternuiez, moment où les plumes explosent de votre visage.",
            "Votre corps (aucun de vos vêtements ou équipement) se téléporte de 3 mètres dans une direction aléatoire.",
            "Vous lancez le sort Graisse centré sur vous-même.",
            "Vous lancez le sort Fou Rire de Tasha sur la créature la plus proche de vous. S'il n'y a pas d'autre créature à portée, vous vous ciblez vous-même.",
            "Les créatures ont un désavantage aux jets de sauvegarde contre le prochain sort que vous lancerez dans la minute qui suit et qui implique un jet de sauvegarde.",
            "Un jeu de Cartes Merveilleuses apparaît, planant devant vous dans l'expectative, visible et touchable uniquement par vous. Il disparaît à la fin de votre prochain tour.",
            "Votre peau prend une teinte bleue éclatante. Un sort de Délivrance des Malédictions peut mettre fin à cet effet.",
            "Si vous subissez des dégâts d'acide, de froid, de feu, de foudre ou de tonnerre dans la minute qui suit, vous gagnez une résistance à ce type de dégâts pendant 1 heure.",
            "Un œil apparaît sur votre front pendant la minute suivante. Pendant cette période, vous avez l'avantage sur les tests de Sagesse (Perception) qui reposent sur la vue.",
            "Vous gagnez une forme aléatoire de folie à court terme (voir le Guide du Maître du Donjon).",
            "Pendant la minute qui suit, tous vos sorts dont le temps d'incantation est de 1 action ont un temps d'incantation de 1 action bonus.",
            "Vous rompez votre harmonisation avec 1d3 de vos objets magiques avec lesquels vous êtes harmonisé.",
            "Vous vous téléportez à une distance de 18 mètres dans un espace inoccupé de votre choix que vous pouvez voir.",
            "Vous lancez le sort Hâte sur vous.",
            "Vous êtes transporté dans le Plan Astral jusqu'à la fin de votre prochain tour, après quoi vous retournez dans l'espace que vous occupiez précédemment ou dans l'espace inoccupé le plus proche si cet espace est occupé.",
            "Vous lancez le sort Silence centré sur vous.",
            "Maximise les dégâts du prochain sort destructeur que vous lancerez au cours de la prochaine minute, au lieu de faire un jet de dé.",
            "Vos pieds et vos mains disparaissent. Vous tombez à plat ventre et laissez tomber tout ce que vous portez. Vous ne pouvez pas vous relever, ni tenir ou manipuler des objets jusqu'à ce que vos appendices réapparaissent au début de votre prochain tour.",
            "Lancez un d10. Votre âge change d'un nombre d'années égal au résultat du jet. Si le résultat est impair, vous rajeunissez ( 1 an au minimum). Si le résultat est pair, vous vieillissez.",
            "Vous lancez le sort Déguisement et prenez l'apparence de l'humanoïde le plus proche que vous puissiez voir. Si vous ne voyez pas d'humanoïde, vous prenez l'apparence d'un humain albinos nu, chauve et androgyne, sans traits faciaux.",
            "1d6 Flumphs contrôlés par le MJ apparaissent dans des espaces inoccupés à moins de 18 mètres de vous et sont effrayés par vous. Ils disparaissent au bout d'une minute.",
            "Une bande d'oiseaux colorés surexcités (utilisez le bloc de stat d'une nuée de corbeaux) apparaît dans votre espace et vous attaque. La volée disparaît 1 minute plus tard.",
            "Vous regagnez 2d10 points de vie.",
            "Vous voyez brièvement l'avenir. Lancez un d20. La prochaine fois qu'une créature fera un test de caractéristique, un jet d'attaque ou un jet de sauvegarde, le nombre obtenu sera remplacé par le nombre que vous avez obtenu.",
            "Vous vous transformez en plante en pot jusqu'au début de votre prochain tour. Pendant que vous êtes une plante, vous êtes incapable d'agir et vulnérable à tous les dégâts. Si vous tombez à 0 point de vie, votre pot se brise et vous reprenez votre forme.",
            "Vous êtes empoisonné jusqu'à ce que vous utilisiez votre action pour faire un test de Constitution DD 12. En cas de succès, vous vomissez et l'effet prend fin.",
            "Pendant la minute qui suit, vous pouvez vous téléporter jusqu'à 6 mètres en tant qu'action bonus à chacun de vos tours.",
            "Vous vous endormez et faites des rêves extrêmement heureux pendant la minute qui suit, ou jusqu'à ce que vous subissiez des dégâts ou qu'une créature utilise son action pour vous réveiller.",
            "Vous lancez le sort Lévitation sur vous-même.",
            "Toutes les pièces que vous avez sur vous tombent sur le sol à vos pieds. Il faut une action pour ramasser 100 pièces éparpillées.",
            "Une licorne contrôlée par le MJ apparaît dans un espace situé à moins de 1,5 mètres de vous, puis disparaît 1 minute plus tard.",
            "Vous lancez le sort Flou.",
            "Vous ne pouvez pas parler pendant la minute qui suit. Chaque fois que vous essayez, des bulles roses sortent de votre bouche.",
            "Vous réalisez soudain que vous n'êtes rien d'autre qu'un personnage fictif dans un jeu joué par d'autres créatures dans un autre plan d'existence, ce qui vous étourdit. Cette crise existentielle dure jusqu'au début de votre prochain tour, après quoi vous la considérez comme un non-sens.",
            "Un bouclier spectral plane près de vous pendant la prochaine minute, vous accordant un bonus de +2 à la CA et une immunité au sort de missile magique.",
            "Vous vous sentez chanceux. Vous réussissez automatiquement le prochain jet de sauvegarde que vous ferez dans la minute qui suit.",
            "Vous êtes immunisé contre l'intoxication par l'alcool pendant les 5d6 prochains jours.",
            "Vous gagnez 2d10 points de vie temporaires.",
            "Vos cheveux tombent mais repoussent dans les 24 heures.",
            "Vous lancez le sort Lueurs Féerique centré sur vous-même.",
            "Pendant la minute qui suit, tout objet inflammable que vous touchez et qui n'est pas porté ou transporté par une autre créature s'enflamme.",
            "Si vous êtes en combat, vous relancez votre ordre dans l'initiative à la fin de ce round.",
            "Vous regagnez votre emplacement de sort du plus bas niveau dépensé.",
            "Vous perdez votre bonus de compétence pour la minute suivante.",
            "Pendant la minute qui suit, vous devez crier quand vous parlez.",
            "Votre pantalon tombe. Jusqu'à ce que vous utilisiez une action bonus ou une action pour le relever, votre vitesse de marche est réduite à 3 mètres et vous avez un désavantage aux jets de sauvegarde de Force et de Dextérité. Si vous ne portez pas de pantalon, vous tombez à plat ventre.",
            "Vous lancez le sort Nappe de brouillard centré sur vous-même.",
            "Vous effectuez immédiatement un coup sans arme contre une créature aléatoire située à moins de 1,5 mètres de vous. S'il n'y a pas de créature à portée, vous vous ciblez vous-même.",
            "Jusqu'à trois créatures de votre choix situées à moins de 9 mètres de vous subissent 4d10 dégâts de foudre.",
            "Une fosse de 1d10 x 30 cm de profondeur et de 1,5 mètres de diamètre apparaît sous vos pieds. Vous tombez à moins que vous n'utilisiez votre réaction pour réussir un jet de sauvegarde de Dextérité DC 11 pour vous agripper au bord de la fosse. Le fond de la fosse remonte magiquement 1 minute plus tard, ne laissant aucune trace de la fosse.",
            "Vous êtes effrayé par la créature la plus proche jusqu'à la fin de votre prochain tour.",
            "Vous n'avez plus besoin de respirer pendant 1d8 heures.",
            "Chaque créature située à moins de 9 mètres de vous devient invisible pendant la minute qui suit. L'invisibilité prend fin sur une créature lorsqu'elle attaque ou lance un sort.",
            "Toutes les rations que vous transportez se transforment en savon.",
            "Vous gagnez une résistance à tous les dégâts pendant la minute suivante.",
            "Vous lancez le sort Peur dans la direction à laquelle vous faites face.",
            "Une créature aléatoire située à moins de 18 mètres de vous est empoisonnée pendant 1d4 heures.",
            "Un simulacre de vous-même apparaît dans un rayon de 6 mètres autour de vous. Il se défend s'il est attaqué, mais il ne peut pas parler et se contente de regarder autour de lui, complètement confus. Il se transforme en neige 1 minute plus tard.",
            "Vous brillez d'une lumière vive dans un rayon de 9 mètres pendant la minute suivante. Toute créature qui termine son tour à moins de 1,5 mètres de vous est aveuglée jusqu'à la fin de son prochain tour.",
            "Vous devenez daltonien jusqu'à votre prochain repos long.",
            "Vous lancez Métamorphose sur vous-même. Si vous échouez au jet de sauvegarde, vous vous transformez en mouton pour la durée du sort.",
            "Un vent violent tourbillonne autour de vous dans un rayon de 3 mètres, et les attaques à distance qui entrent ou sortent de cette aura sont automatiquement ratées.",
            "Des papillons et des pétales de fleurs illusoires voltigent dans l'air à moins de 3 mètres de vous pendant la minute qui suit.",
            "Vous gagnez une vision véritable jusqu'à une portée de 18 mètres pendant la minute suivante.",
            "Vous pouvez prendre une action supplémentaire immédiatement.",
            "De minuscules ailes de fée vous poussent sur les épaules. Vous êtes sous l'effet d'un sort de Feuille Morte jusqu'à ce qu'elles disparaissent au bout de 1d8 jours.",
            "Chaque créature située à moins de 9 mètres de vous subit 1d10 points de dégâts nécrotiques. Vous regagnez un nombre de points de vie égal à la somme des dégâts nécrotiques infligés.",
            "Tout ce qui est en or sur vous (y compris les pièces de monnaie) se transforme en argent, et tout ce qui est en argent se transforme en or.",
            "Vous lancez le sort Image Miroir.",
            "Vous êtes pétrifié pendant 1d10 rounds.",
            "Vous lancez le sort de vol sur une créature aléatoire dans un rayon de 18 mètres autour de vous..",
            "Une colonne de 1d10 x 30 cm de haut et de 1,5 mètres de diamètre s'élève sous vos pieds. Si cette hauteur la fait entrer en collision avec un plafond ou un objet au-dessus de vous, vous êtes immobilisé et subissez 2d6 dégâts de matraquage, coincé contre l'objet, à moins que vous n'utilisiez votre réaction pour réussir un jet de sauvegarde de Dextérité DD 11 pour sauter. La colonne s'enfonce lentement dans le sol 1 minute plus tard, ne laissant aucune trace.",
            "Vous devenez invisible pendant la minute qui suit. Pendant ce temps, les autres créatures ne peuvent pas vous entendre. L'invisibilité prend fin si vous attaquez ou lancez un sort.",
            "Une bobine de corde de chanvre de 15 mètres apparaît immédiatement et vous attache. Vous êtes entravé. Une créature peut rompre les cordes en leur infligeant 5 points de dégâts tranchants ou de feu, ou en réussissant un test d'Athlétisme DD 11 (Force). Vous pouvez également vous échapper en réussissant un test de Dextérité (Acrobatie) DD 11.",
            "Si vous mourez dans la minute qui suit, vous revenez immédiatement à la vie comme par le sort Réincarnation.",
            "Un petit nuage de pluie apparaît au-dessus de votre tête et pleut dans un rayon de 1,5 m autour de vous pendant la minute qui suit. Les flammes nues dans la zone sont éteintes.",
            "Votre taille augmente d'une catégorie de taille pendant la minute suivante.",
            "Vos bras s'étirent. Vous gagnez une portée de 4,5 mètres pendant la minute suivante.",
            "Vous et toutes les créatures situées à moins de 9 mètres de vous gagnez une vulnérabilité aux dégâts perforants pendant la prochaine minute.",
            "Lancez un d10. Votre poids change d'un nombre de kilos égal au résultat du jet. Si le résultat est impair, vous perdez du poids. Si le résultat est pair, vous gagnez du poids.",
            "Vous êtes entouré d'une faible musique éthérée pendant la minute qui suit.",
            "Vous subissez 2d10 dégâts psychiques. Ces dégâts ne peuvent pas réduire vos points de vie en dessous de 1.",
            "Vous échangez vos âmes avec une créature aléatoire située à moins de 9 mètres de vous. Vous la contrôlez à son prochain tour, et elle vous contrôle à votre prochain tour. Vous reprenez votre corps normal à la fin de votre prochain tour, si le corps est encore en vie.",
            "Vous regagnez tous les points de sorcellerie dépensés."
        ]
    },    
    "homebrew_2":{
        "_comment": "https://www.dandwiki.com/wiki/Wild_Magic_Surge_Table,_Variant_(5e_Variant_Rule)",
        "values_extreme": [
            "A fireball explodes with you at the center. You and each creature within 20 feet of you who must make a Dexterity saving throw using your spell save DC, taking 5d6 fire damage on a failed save, or half as much damage on a successful one.",
            "You recover all your expended spell slots.",
            "You lose the ability to hear for 1 day.",
            "Each creature within 30 feet of you takes 1d10 necrotic damage. You regain hit points equal to the sum of damage dealt.",
            "You teleport to an alternate plane, then return to the location where you started after 1 minute.",
            "You transform into a large empty barrel for 1 minute, during which time you considered petrified.",
            "You are at the center of a darkness spell for 1 minute.",
            "You are frightened by the nearest creature until the end of your next turn.",
            "You are resistant to all damage types for 1 minute.",
            "A random creature within 60 feet of you is poisoned for 1d4 hours.",
            "Make a Wisdom saving throw against your own spell save DC. If you fail, you are polymorphed into giant dragonfly for 1 minute.",
            "Up to three creatures you choose within 30 feet of you take 4d10 lightning damage.",
            "You immediately gain 20 temporary hit points.",
            "You teleport up to 60 feet to an unoccupied space that you can see.",
            "You are the center of a silence spell for 1 minute.",
            "You are vulnerable to fiends for 1 hour. Such creatures gain advantage on attack rolls made against you.",
            "For the next day, any time you make an ability check, roll 1d6 and subtract the result.",
            "For any spell that requires a saving throw you cast within the next minute, the target gains advantage.",
            "The next single target spell you cast within the next minute must target one additional target.",
            "A demon whose CR is equal to your level appears near you. Make a Charisma saving throw against your spell save DC. If you make it, the demon is subservient, otherwise, it is hostile. The demon, if not banished or defeated, vanishes after 1 day.",
            "For the next minute, every creature within 60 feet of you that hears you speak only hears insults as if you are casting vicious mockery at first level.",
            "For the next day, you have advantage on the next 2d6 rolls you make where you don't already have advantage.",
            "You are protected from Aberrations for 1 day. Such creatures cannot attack you or harm you unless they save a Charisma saving throw against your spell save DC.",
            "For 1 minute, a duplicate of yourself appears in the nearest open space which can take actions independently, and goes on the same Initiative as you. However, any damage it takes as well as any spell slots or sorcery point it uses applies to you as well.",
            "A loud boom emanates from you. All creatures within 15 feet take 2d8 thunder damage and must make a Constitution saving throw against your spell save DC or be deafened for 1 minute.",
            "All creatures within 60 feet of you regain 2d8 hit points.",
            "You transform into a marble statue of yourself for 1 minute, during which time you are considered petrified.",
            "You are immune to disease for 1 week.",
            "You immediately drop to 0 hit points.",
            "Make a Wisdom saving throw against your own spell save DC. If you fail, you are transformed into a raven for 1 minute, as if by a polymorph spell.",
            "You are protected from Beasts for 1 day. Such creatures cannot attack you or harm you unless they save a Charisma saving throw against your spell save DC.",
            "You transform into a stuffed toy resembling yourself for 1 minute, during which time you are considered petrified.",
            "You stand at the center a circular wall of fire with a radius of 15 feet. Any creature in any of the spaces covered by this fire must make a Dexterity saving throw against your spell DC or take 5d8 fire damage. The wall of fire remains for 1 minute.",
            "Choose 1 permanent or triggered effect that has happened to you or somebody else that you've received from this chart and remove it, even if it was beneficial.",
            "You are vulnerable to Beasts for 1 hour. Such creatures gain advantage when attacking you.",
            "You permanently lose the ability to smell. This sense can be restored with a spell that removes curses such as remove curse.",
            "You are vulnerable to Celestials for 1 hour. Such creatures gain advantage when attacking you.",
            "Make a Wisdom saving throw against your spell save DC. If you fail, you are transformed into a cat for 1 minute, as if by a polymorph spell.",
            "You are vulnerable to Plants for 1 hour. Such creatures gain advantage when attacking you.",
            "You gain the service of an arcane eye for 1 hour that does not require concentration.",
            "You are protected from Celestials for 1 day. Such creatures cannot attack you or harm you unless they succeed on a Charisma saving throw against your spell save DC.",
            "You transform into a medium-sized potted plant for 1 minute, during which time you are considered petrified.",
            "3d6 random gems appear near you, worth 50gp each.",
            "All allies within 20 feet of you gain a +2 bonus to attack and damage rolls on any melee weapon attack they make within the next minute.",
            "For 2d6 days, you glow bright yellow. You have disadvantage on Stealth checks and anyone trying to perceive you has advantage on their Perception check.",
            "You stand at the center a circular wall of force with a radius of 15 feet. Any creature in any of the spaces covered by this wall must make a Dexterity saving throw against your spell DC or take 5d8 force damage. The wall remains for 1 minute.",
            "All creatures within 20 feet of you are knocked prone.",
            "You are vulnerable to Aberrations for 1 hour. Such creatures gain advantage when attacking you.",
            "For the next day, you are in the Border Ethereal near the location you were last in.",
            "All allies within 20 feet of you gain a +2 bonus to attack and damage rolls on any ranged weapon attack they make within the next minute.",
            "You are at the center of a 10-foot radius antimagic field that negates all magic equal to or less than your level for 1 hour and does not require concentration.",
            "Make a Wisdom saving throw against your spell save DC. If you fail, you are transformed into a wolf for 1 minute, as if by a polymorph spell.",
            "You are protected from Elementals for one day. Such creatures cannot attack you or harm you unless they succeed on a Charisma saving throw against your spell save DC.",
            "All of your hair permanently falls out. Only a spell such as remove curse can end this effect.",
            "You gain the ability to speak one new language of your choice. However, you lose the ability to speak one language you already know.",
            "A 30-foot cube hypnotic pattern appears with you at the center. All creatures within the pattern must succeed on a Wisdom saving throw or fall asleep for 1 minute or until they take damage.",
            "You permanently forget one cantrip. A spell such as remove curse can restore your memory.",
            "You immediately take 2d10 psychic damage.",
            "You are vulnerable to Undead for 1 hour. Such creatures gain advantage when attacking you.",
            "You transform into an iron statue of yourself for 1 minute, during which time you are considered petrified.",
            "You gain an additional spell slot of your highest level for 1 week.",
            "If you die within the next minute, you come back to life as if by the reincarnate spell.",
            "You permanently gain one spell slot of one level below your highest-level spell slot, but lose one 1st-level spell slot. A spell such as remove curse can end this effect.",
            "All creatures that can perceive you must make a Wisdom saving throw against your spell save DC or be frightened of you.",
            "You are vulnerable to Elementals for 1 hour. Such creatures gain advantage when attacking you.",
            "You are protected from Fey for 1 day. Such ceatures cannot attack you or harm you unless they succeed on a Charisma saving throw against your spell save DC.",
            "You gain the service of an arcane sword that does not require concentration until your next short or long rest.",
            "You permanently gain one cantrip. A spell such as remove curse can end this effect.",
            "All allies within 20 feet of you get gain a -2 penalty on attack and damage rolls for any melee attack they make in the next minute.",
            "All allies within 20 feet of you heal up to 3d8 hit points.",
            "You lose the ability to see for 1 day. During this time, you have the blinded condition.",
            "You gain the service of a phantom steed for 1 week.",
            "Make a Constitution saving throw against your spell save DC. If you fail, you are stunned for 1 minute.",
            "You transform into a stone statue of yourself for 1 minute, during which time you are considered petrified.",
            "All creatures within 20 feet of you, including you, must make a Dexterity save against your spell save DC or be affected by a faerie fire spell.",
            "Permanently increase one ability score of your choice by 1 point. Permanently decrease a different ability score of your choice by 1 point. A spell such as remove curse can end this effect.",
            "You gain proficiency in one tool or weapon type you don't already have for 1 day.",
            "Make a Wisdom saving throw against your spell save DC. If you fail, you are transformed into a giant spider for 1 minute, as if by the polymorph spell.",
            "Gain the sympathy effects of the antipathy/sympathy spell for 3d6 days.",
            "You are protected from Fiends for one day. Such creatures cannot attack you or harm you unless they succeed on a Charisma saving throw against your spell save DC.",
            "All allies within 20 feet of you gain a -2 penalty to attack and damage rolls for any ranged attack they make within the next minute.",
            "For one minute, any spell with a casting time of 1 action can be cast as a bonus action.",
            "Make a Wisdom saving throw against your spell save DC. If you fail, you are transformed into a giant rabbit for 1 minute, as if by the polymorph",
            "The next time you cast a spell, do not roll on this chart.",
            "For the next day, you gain proficiency in all skills that you are not already proficient in.",
            "The next time you cast a spell, roll twice on this chart. Both effects will apply.",
            "You are vulnerable to Fey for 1 hour. Such creatures gain advantage when attacking you.",
            "You transform into an empty wooden chest for 1 minute, during which time you are considered petrified.",
            "Gain the antipathy effects of the antipathy/sympathy spell for 3d6 days.",
            "All creatures within 30 feet of you must make a Wisdom saving throw. Any creature immune to magical sleep automatically succeeds on its saving throw. Those that fail fall asleep for 1d6 minutes.",
            "You are protected from Plants for 1 day. Such creatures cannot attack you or harm you unless they succeed on a Charisma saving throw against your spell save DC.",
            "All your allies within 20 feet of you gain a +2 bonus to their AC for 1 minute.",
            "The next time you fall below 0 hit points within the next month, you automatically fail your first death saving throw.",
            "You gain two spell slots at your second-highest level for 1 week.",
            "For the next day, any time you make an ability check, roll 1d6 and add the result.",
            "Make a Wisdom saving throw against your spell save DC. If you fail, you are transformed into a sheep for 1 minute, as if by the polymorph spell.",
            "All allies within 30 feet of you gain a -2 penalty to their AC for 1 minute.",
            "You are protected from Undead for 1 day. Such creatures cannot attack you or harm you unless they succeed on a Charisma saving throw against your spell save DC.",
            "You jump forward in time exactly 1 minute, for 1 minute. From the perspective of everyone else, you cease to exist during that time.",
            "All spells you cast within the next minute automatically fail."
        ],
        "values_moderate": [
            "For the next day, your skin tone changes color every 30 minutes, cycling through the colors of the rainbow.",
            "You are confused for 1 minute, as though you were affected by the confusion spell.",
            "Your Strength is increased by 2 for 1 day.",
            "A third eye appears in your forehead, giving you advantage on sight-based Wisdom (Perception) checks for 1 minute.",
            "The next spell you cast within the next minute that does damage, the damage is maximized.",
            "For the next minute, you can teleport up to 20 feet as part of your movement on each of your turns.",
            "You become intoxicated for 2d6 hours.",
            "Your Intelligence is decreased by 2 for 1 day.",
            "Your Wisdom is increased by 2 for 1 day.",
            "For 1 minute, any flammable item you touch, that you aren't already wearing or carrying, bursts into flame.",
            "Plants grow around you and you are restrained for 1 minute.",
            "A random creature within 30 feet of you gains a flying speed equal to its walking speed for 1 minute.",
            "You may immediately take 1 additional action.",
            "If you fall within the next day, you automatically have the benefit of the feather fall spell.",
            "You recover 1 expended spell slot of your choice.",
            "For the next spell you cast within 1 minute that does damage, the damage is minimized.",
            "You have are surrounded by a spectral shield for 1 minute, giving you a +2 bonus to your AC and immunity to magic missile.",
            "You and all creatures within 30 feet of you gain vulnerability to piercing damage for 1 minute.",
            "For 1 minute, you gain resistance to nonmagical bludgeoning, piercing, and slashing damage.",
            "You are protected from Elementals for 1 hour. Such creatures cannot attack you or harm you unless they succeed on a Charisma saving throw against your spell save DC.",
            "For the next minute, one creature of your choice gets a -2 penalty to its AC, attack rolls, and damage rolls.",
            "You and all creatures within 30 feet of you gain vulnerability to bludgeoning damage for 1 minute.",
            "You emanate light in a 30-foot radius for 1 minute. Any creature within 5 feet of you that can see is blinded until the end of its next.",
            "For the next hour, you gain advantage on Charisma checks when dealing with any creature wearing black, but disadvantage if they are wearing white. If they are wearing both, this doesn't apply.",
            "You are protected from Plants for 1 hour. Such creatures cannot attack you or harm you unless they succeed on a Charisma saving throw against your spell save DC.",
            "Your Intelligence is increased by 2 for 1 day.",
            "Within the next hour, you have advantage on the next roll you make where you don't already have advantage.",
            "You gain a +2 bonus to your AC for 1 minute.",
            "For the next minute, you are in the Border Ethereal near the location you were last in.",
            "For the next minute, you gain resistance to thunder and force damage.",
            "An imp appears within 30 feet of you. Make a Charisma saving throw against your spell save DC. If you succeed it, the imp is subservient, otherwise, it is hostile. The imp, if not banished or defeated, vanishes after 1 day.",
            "For the next minute, you gain resistance to fire and cold damage.",
            "For the next hour, you gain advantage on Charisma checks when dealing with any creature wearing red, but disadvantage if they are wearing green. If they are wearing both, this doesn't apply.",
            "You gain the service of an arcane eye for 1 minute that does not require concentration.",
            "You lose the ability to smell for 1 day.",
            "You gain a -2 penalty to your AC for 1 minute.",
            "You and all creatures within 30 feet of you gain vulnerability to necrotic damage for 1 minute.",
            "You become invisible and silent for 1 minute.",
            "Your Dexterity is increased by 2 for 1 day.",
            "You can detect the thoughts of 1 creature you can see within 30 feet of you for 1 minute.",
            "For the next minute, all melee attacks you make with a non-magical weapon gain a +1 bonus to hit and to damage, and are considered magical for the purpose of overcoming resistances.",
            "Your Strength is decreased by 2 for 1 hour.",
            "You gain freedom of movement for 1 day.",
            "Your Dexterity is decreased by 2 for 1 hour.",
            "You are affected by a faerie fire spell for 1 minute. You automatically fail the saving throw.",
            "You are protected from Beasts for 1 hour. Such creatures cannot attack you or harm you unless they succeed a Charisma saving throw against your spell save DC.",
            "3d6 gold pieces appear near you.",
            "For 2d6 hours, you have a faint pink glow. Anyone trying to perceive you has advantage on their Perception check.",
            "You gain the ability to breath water for 1 day.",
            "You and all creatures within 30 feet of you gain vulnerability to slashing damage for 1 minute.",
            "For the next minute, light and darkness quickly alternate around you in a 30-foot radius, creating a strobe effect. Sight-based creatures gain a -1 penalty on attack rolls against you and Perception checks against you, and you gain a +1 bonus to Stealth checks.",
            "All creatures within 20 feet of you must make a Strength saving throw against your spell save DC or be knocked prone.",
            "You are protected from Undead for one hour. Such creatures cannot attack you or harm you unless they succeed on a Charisma saving throw against your spell save DC.",
            "For the next minute, you can pass through any solid, non-magical wall that is 6 or fewer inches thick.",
            "You are protected from Fiends for one hour. Such creatures cannot attack you or harm you unless they succeed on a Charisma save against your spell save DC.",
            "You permanently gain one 1st-level spell slot but forget one cantrip that you already know. A spell such as remove curse can end this effect.",
            "You immediately gain 15 temporary hit points.",
            "All gold you are carrying is now silver.",
            "For the next minute, you gain resistance to necrotic and radiant damage.",
            "You are at the center of a fog cloud spell which lasts for 1 minute.",
            "Your Charisma is increased by 2 for 1 day.",
            "You and all creatures within 30 feet of you gain vulnerability to lightning damage for 1 minute.",
            "You and all creatures within 30 feet of you gain vulnerability to force damage for 1 minute.",
            "For the next minute, any creature you touch takes 2d6 lightning damage.",
            "You gain blindsight with a radius of 60 feet for 1 minute.",
            "You are surrounded by a horrible, noxious odor for 1 minute. Anyone within 10 feet of you must make a Constitution saving throw or be stunned.",
            "Your Charisma is decreased by 2 for 1 hour.",
            "You gain the service of a phantom steed for 1 day.",
            "You and all creatures within 30 feet of you gain vulnerability to acid damage for 1 minute.",
            "Your Wisdom is decreased by 2 for 1 hour.",
            "Your speed is increased by 10 feet for 1 day.",
            "You gain the ability to walk on water for 1 day.",
            "You and all creatures within 30 feet of you gain vulnerability to psychic damage for 1 minute.",
            "One creature of your choice gets a +2 bonus to all attack rolls, damage rolls, and their armor class AC for 1 minute.",
            "You lose proficiency in one randomly chosen skill, tool, or weapon type for 2d6 days.",
            "All food and drink within 30 feet of you becomes putrid, spoiled, or rotten. Consuming this food deals 2d6 poison damage and causes the poisoned condition for 1 hour.",
            "All silver you are carrying is now copper.",
            "You and all creatures within 30 feet of you gain vulnerability to fire damage for 1 minute.",
            "You lose proficiency in all skill rolls for 1d4 hours.",
            "You are protected from Fey for one hour. Such creatures cannot attack you or harm you unless they succeed on a Charisma saving throw against your spell save DC.",
            "For the next hour, any time you make an ability check, roll 1d6 and subtract the result.",
            "For the next minute, you gain resistance to poison and psychic damage.",
            "You're feeling lucky. For the next hour, any time you make an ability check, roll 1d6 and add the result.",
            "You immediately take 2d6 psychic damage.",
            "You gain proficiency in one skill of your choice that you're not already proficient in for one hour.",
            "Your Constitution is increased by 2 for 1 day.",
            "You and all creatures within 30 feet of you gain vulnerability to thunder damage for 1 minute.",
            "You and all creatures within 30 feet of you gain vulnerability to cold damage for 1 minute.",
            "You gain the ability to speak one language of your choice for 1 day.",
            "You and all creatures within 30 feet of you gain vulnerability to radiant damage for 1 minute.",
            "You are protected from Celestials for 1 hour. Such creatures cannot attack you or harm you unless they succeed a on a Charisma saving throw against your spell save DC.",
            "For the next minute, you are unable to cast any spell that causes damage of any type.",
            "You gain spider climb for 1 minute, and it does not require concentration to maintain.",
            "You immediately lose all unspent sorcery points and may not regain them until you have finished a long rest.",
            "You and all creatures within 30 feet of you gain vulnerability to poison damage for 1 minute.",
            "You gain the ability to speak with animals for 1 day.",
            "All food and drink within 30 feet of you is purified.",
            "You are protected from Aberrations for 1 hour. Such creatures cannot attack you or harm you unless they succeed on a Charisma savinng throw against your spell save DC.",
            "All your clothing and equipment teleports to the nearest open space at least 15 feet from you that you can see.",
            "Your Constitution is decreased by 2 for 1 hour."
        ],
        "values_nuisance": [
            "A puddle of grease appears where you are standing, with a 10-foot radius. You and anyone within 10 feet of you must make a Dexterity check at your spell save DC or fall prone.",
            "You levitate 6 inches off the ground for 1 minute.",
            "You gain tremorsense with a range of 30 feet for 1 minute.",
            "You make no sounds for 1 minute and you gain advantage on any Dexterity (Stealth) checks.",
            "You grow a beard made of feathers, which remains until you sneeze.",
            "You can't speak for 1 minute. When you try, pink bubbles float out of your mouth.",
            "You are immune to intoxication for the next 5d6 days.",
            "You recover your lowest-level expended spell slot.",
            "For the next minute, you must shout when you speak.",
            "Illusory butterflies and flower petals flutter in the air around you in a 10-foot radius for 1 minute.",
            "You cast mirror image on yourself, which lasts for 1 minute and does not require concentration.",
            "You are surrounded by faint, ethereal music for 1 minute.",
            "You regain all expended sorcery points.",
            "Your hair grows to double its current length over the next minute.",
            "Your hair falls out but grows back within 1 day.",
            "You gain the ability to speak one additional language of your choice for 1 hour.",
            "You are invisible for 1 minute.",
            "Your eyes permanently change color. If they are a blue or grey shade, they turn dark brown, or vice versa. A spell such as remove curse can end this effect.",
            "Small birds flutter and chirp in your vicinity for 1 minute, during which time you automatically fail any Stealth check.",
            "You feel the incredible urge to relieve yourself. Until you do, your Strength and Intelligence are reduced by 1. If you don't relieve yourself in the next 2 minutes, the above effects are removed, but your Charisma score is reduced by 4 for 1 hour or until you change your trousers.",
            "Gnats buzz around your head for 1 minute, distracting you. You must make a Constitution saving throw against your own spell save DC to cast any spell.",
            "You are surrounded by a faint, offensive odor for 1 minute. You gain disadvantage on all Charisma checks.",
            "For the next minute, all spells with a casting time of 1 action or 1 bonus action require 2 consecutive actions to cast.",
            "You have the irresistible urge to scratch an itch in the middle your back, just out of reach, for 1 minute. If you don't scratch it using a back scratcher or some similar device , you must succeed a Constitution saving throw against your spell save DC to cast a spell.",
            "You have a momentary vision of your own death. If you fail a Wisdom saving roll at your spell DC, you are frightened for 1 minute.",
            "Your Charisma is increased by 2 for 1 minute.",
            "Over the next minute, all plants within 20 feet of you grow as if affected by the plant growth spell when cast as an action.",
            "Your eyes glow red for 1 minute.",
            "Your Constitution is increased by 2 for 1 minute.",
            "You add your proficiency bonus to all Charisma checks for the next hour, if you don't already add it.",
            "Your spell components seem to have been rearranged. During the next hour, you must make an Intelligence check against your spell save DC to cast any spell that requires a material component.",
            "For the next minute, you have advantage on the next roll you make where you don't already have advantage.",
            "Every creature within 15 feet of you takes 1 necrotic damage. If you are wounded, you regain hit points up to the amount of damage dealt. If you are not wounded, you gain this amount of temporary hit points.",
            "A magic mouth appears on a nearby wall or flat surface. When you speak, your voice comes from the magic mouth. This lasts for 1 minute.",
            "You can hear exceptionally well for 1 minute, gaining advantage for all Perception checks related to sound.",
            "You lose the ability to smell for 1 hour.",
            "For the next day, each time you say a word with the 's' sound, it sounds like a hissing snake.",
            "A gentle gust of wind blows outward from you. All creatures within 40 feet of you can feel it, but it otherwise does nothing.",
            "Your Dexterity is increased by 2 for 1 minute.",
            "You immediately take 1d10 radiant damage.",
            "One randomly-chosen non-magical item in your possession that weighs 1 pound or less vanishes and is forever gone.",
            "Your Wisdom is increased by 2 for 1 minute.",
            "You immediately gain 10 temporary hit points.",
            "3d6 silver pieces appear near you.",
            "You regain 5 hit points per round for 1 minute.",
            "An imp appears near you. Make a Charisma saving throw against your spell save DC. If you succeed, the imp is subservient, otherwise, it is hostile. The imp, if not banished or defeated, vanishes after 1 hour.",
            "Your speed is increased by 10 feet for 1 minute.",
            "You gain proficiency on all Strength checks for the next hour, if you don't already have it.",
            "Your Intelligence is increased by 2 for 1 minute.",
            "One randomly-chosen non-magical item in your possession that weighs 1 pound or less is duplicated.",
            "Mushrooms sprout around you in a 5-foot radius and vanish after 1 minute. If one is harvested and eaten within this time, the creature must make a Constitution saving throw against your spell save DC. On a failed save, it takes 5d6 poison damage. On successful one, it gains 5d6 temporary hit points.",
            "You can smell exceptionally well for 1 minute, gaining blindsight with a radius of 10 feet and advantage on all Perception checks related to odor.",
            "Your feet sink into the ground, making you completely immobile for one minute. This has no effect if you were not standing on the ground when the spell was cast.",
            "One random gem worth 100gp appears near you.",
            "For the next minute, you have double vision. This gives you disadvantage on ranged attacks (including spell attacks) and Perception checks involving sight.",
            "You are surrounded by a faint, pleasant odor. You gain advantage on all Charisma checks you make within the next minute.",
            "You lose proficiency on all skill checks for 1 minute.",
            "You gain freedom of movement for 1 minute.",
            "You gain darkvision with a radius of 60 feet for 1 minute. If you already have darkvision, you lose it for 1 minute.",
            "Approximately 100 gallons of water appear over your head and those within 10 feet of you, evenly distributed above everybody within the radius.",
            "You gain a +1 to your AC for one minute.",
            "You fall victim to a horrible cramp in both legs, reducing your speed by 10 feet for 1 hour.",
            "The next spell you cast within the next hour uses a spell slot of one level lower than what it normally requires. If the spell is a spell of 1st level, you still must expend a spell slot to cast it.",
            "For the next hour, you are unable to read as the letters all appeared jumbled.",
            "For the next day, everything you say must rhyme. If it doesn't, you take 1d6 psychic damage.",
            "During the next hour, you may re-roll any one save, attack roll, or skill check. If you do, you must take the new roll's result.",
            "You grow 1d6 inches in height. You gradually return to your original height over the course of 1 day.",
            "You immediately take 2d4 psychic damage.",
            "For the next hour, any time you make an ability check, roll 1d4 and subtract the result.",
            "You gain the ability to speak with animals for one hour.",
            "You get gain a -1 penalty to your AC for 1 minute.",
            "You gain the use of an unseen servant for 1 hour.",
            "The next spell you cast within the hour uses a slot level one level higher than what it normally requires.",
            "A bad joke comes to mind and until you tell it (which takes an entire action), you suffer a Wisdom penalty of 1.",
            "You hear a ringing in your ears for 1 minute. During this time, casting a spell that requires a verbal component requires a Constitution check against your spell save DC.",
            "You lose 1d6x5 pounds. You gradually return to your original weight over the course of 1 day.",
            "Your clothes become dirty and filthy. Until you can change and/or clean your clothes, your Charisma is reduced by 1.",
            "You gain proficiency in Wisdom checks for the next hour, if you don't already have it.",
            "You shrink 1d6 inches in height. You gradually return to your original height over the course of 1 day.",
            "Your skin permanently darkens as if you have a tan, or if you are already dark-skinned, your skin becomes one shade lighter. A spell such as remove curse can end this effect.",
            "For 1 minute, one creature of your choice within 30 feet of you gains a -1 penalty to attack rolls, damage rolls, and their AC.",
            "For the next hour, any time you make an ability check, roll 1d4 and add the result.",
            "If you cast a spell with a saving throw within the next minute, the target gains disadvantage on its saving throw.",
            "Your Strength is increased by 2 for 1 minute.",
            "One creature of your choice gains a +1 bonus to attack rolls, damage rolls, and its AC for 1 minute.",
            "You immediately heal 2d10 hit points.",
            "You gain proficiency on all Intelligence checks for the next hour, if you don't already have it.",
            "The power of your magic is strong! For the next hour, any spell you cast does not require a verbal component.",
            "You gain 1d6x10 pounds. You gradually return to your original weight over the course of 1 day.",
            "You gain proficiency in all Dexterity checks for the next hour, if you don't already have it.",
            "Your fingernails and toenails grow to an uncomfortable length. Until you trim them, your Dexterity is reduced by 1 and your speed is reduced by 5 feet, even if you're not wearing shoes.",
            "You gain the effects of the blur spell for 1 minute, which does not require concentration to maintain.",
            "For the next hour, you appear to others to be the opposite gender.",
            "You gain the service of a 2nd-level spiritual weapon for 1 minute.",
            "The power of your magic is strong! For the next hour, any spell you cast does not require a somatic component.",
            "You gain proficiency in all Constitution checks for the next hour, if you don't already have it.",
            "Every inanimate object that isn't being worn or carried within 40 feet of you becomes enshrouded with shadows for 1 minute. Enshrouded objects are considered heavily obscured.",
            "Your fingers become sore for 1 hour. During this time, you must succeed on a Dexterity saving throw against your spell save DC to cast a spell with a somatic component.",
            "You feel extremely nauseated. Make a Constitution saving throw against your spell save DC. If you fail, you must spend your next action throwing up.",
            "You immediately lose one unspent sorcery point."
        ]
    }
}